<h2 style='color:purple' align='center'>Naive Bayes Tutorial Part 1: Predicting survival from titanic crash</h2>

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [5]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [11]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [7]:
# inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

In [9]:
# inputs.head()

In [12]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [13]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

**I am dropping male column as well because of dummy variable trap theory. One column is enough to repressent male vs female**

In [14]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [15]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [16]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [17]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [18]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [20]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [22]:
model.fit(X_train,y_train)

GaussianNB()

In [23]:
model.score(X_test,y_test)

0.7798507462686567

In [24]:
X_test[0:10]

     Pclass        Age     Fare  female
142       3  24.000000  15.8500       1
680       3  29.699118   8.1375       1
14        3  14.000000   7.8542       1
108       3  38.000000   7.8958       0
837       3  29.699118   8.0500       0
149       2  42.000000  13.0000       0
791       2  16.000000  26.0000       0
546       2  19.000000  26.0000       1
634       3   9.000000  27.9000       1
241       3  29.699118  15.5000       1

In [27]:
y_test[0:10]

142    1
680    0
14     0
108    0
837    0
149    0
791    0
546    1
634    0
241    1
Name: Survived, dtype: int64

In [28]:
model.predict(X_test[0:10])

array([1, 1, 1, 0, 0, 0, 0, 1, 1, 1], dtype=int64)

In [29]:
model.predict_proba(X_test[:10])

array([[0.4011033 , 0.5988967 ],
       [0.41802526, 0.58197474],
       [0.35651437, 0.64348563],
       [0.96848779, 0.03151221],
       [0.96594059, 0.03405941],
       [0.93235399, 0.06764601],
       [0.90431372, 0.09568628],
       [0.20207371, 0.79792629],
       [0.31828281, 0.68171719],
       [0.42008165, 0.57991835]])

**Calculate the score using cross validation**

In [30]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.784     , 0.792     , 0.776     , 0.78225806, 0.74193548])